// data/index.ts
export const classesData = [
  {
    title: 'Personal  training',
    description:
      'Είναι μια εξατομικευμένη προσέγγιση της άσκησης, όπου ένα άτομο γυμνάζεται  απευθείας με έναν γυμναστή. Αυτή η μέθοδος επιτρέπει στον ασκούμενο να επιλέξει το είδος της εκγύμνασης που προτιμά (Pilates, strength training, endurance ,συνοδοί ασκό μεθόδων κ.λπ.), εξασφαλίζοντας παράλληλα την κατάλληλη καθοδήγηση και υποστήριξη.',
    items: [
      {
        title: 'Τι οφέλη έχει αυτή η άσκηση;',
        points: [
          'Προσαρμογή στις Ατομικές Ανάγκες: Ο γυμναστής αξιολογεί τη φυσική κατάσταση, τους στόχους και τυχόν περιορισμούς του ασκούμενου, σχεδιάζοντας ένα πρόγραμμα προσαρμοσμένο στις προσωπικές του ανάγκες. Έρευνες έχουν δείξει ότι η εξατομικευμένη προπόνηση είναι πιο αποτελεσματική από γενικά προγράμματα, καθώς λαμβάνει υπόψη τις μοναδικές ανάγκες του κάθε ατόμου.',
          'Ασφάλεια και Επίβλεψη: Με την καθοδήγηση ενός επαγγελματία, οι ασκούμενοι εκτελούν τις ασκήσεις με σωστή τεχνική, μειώνοντας τον κίνδυνο τραυματισμών. Η συνεχής επίβλεψη διασφαλίζει ότι οι ασκήσεις εκτελούνται με τη σωστή μορφή, κάτι που είναι ιδιαίτερα σημαντικό για αρχάριους ή άτομα με παλαιούς τραυματισμούς.',
          ' Κίνητρα και Υποστήριξη: Ο προσωπικός γυμναστής παρέχει κίνητρα και υποστήριξη, κάτι που μπορεί να οδηγήσει σε καλύτερη συνέπεια και υψηλότερη απόδοση. Έρευνες δείχνουν ότι η παρουσία ενός γυμναστή αυξάνει τη δέσμευση των ασκούμενων και την επίτευξη των στόχων τους.',
          'Στρατηγική Προπόνησης: Ο γυμναστής χρησιμοποιεί επιστημονικές μεθόδους για να σχεδιάσει στρατηγικές προπόνησης που βελτιώνουν τη δύναμη, την αντοχή, την ευελιξία και την καρδιοαγγειακή υγεία. Η εφαρμογή αρχών όπως η προοδευτική υπερφόρτωση και η ποικιλία στις ασκήσεις συμβάλλει στην αποφυγή πλατώ και στη συνεχή πρόοδο',
          'Αποτελέσματα: Μελέτες έχουν αποδείξει ότι οι ασκούμενοι που συμμετέχουν σε personal training εμφανίζουν μεγαλύτερη βελτίωση στις φυσικές τους ικανότητες και επιτυγχάνουν τους στόχους τους πιο γρήγορα σε σύγκριση με τις ομαδικές προπονήσεις.'
        ]
      }
    ]
  },
  {
    title: 'Semi personal training',
    description:
      'Περιλαμβάνει προπόνηση σε μικρές ομάδες 1-3 ατόμων, με επιστημονικά δομημένες μεθόδους υπό την καθοδήγηση εξειδικευμένου γυμναστή ,που στοχεύουν στη βελτίωση της φυσικής κατάστασης. ',
    items: [
      {
        title: 'Τι περιλαμβάνει;',
        points: [
          'Strength training: Προπόνηση αντιστάσεων που βασίζεται στην αρχή της προοδευτικής υπερφόρτωσης (progressive overload). Με την καθοδήγηση του εξειδικευμένου προσωπικού και της συνεχούς εκπαίδευσης του με μακροπρόθεσμο και ρεαλιστικό πλάνο θα σε βοηθήσουμε να πετύχεις τους στόχους σου ρεαλιστικά ,ειτε αυτοί είναι βελτιωση μυϊκής δύναμης ,υπερτροφίας,αποκατάσταση τραυματισμών , μεγιστοποίηση αθλητικής απόδοσης .',
          'Cross training: Ένα πολυδιάστατο σύστημα προπόνησης που συνδυάζει αερόβια και αναερόβια άσκηση, προάγοντας την ταυτόχρονη βελτίωση καρδιαγγειακής υγείας, μυϊκής δύναμης και αντοχής, ενισχύοντας ταυτόχρονα το κινητικό συντονισμό.',
          'Functional training: Στοχεύει στην ενίσχυση των κινητικών προτύπων που χρησιμοποιούνται στην καθημερινότητα, με ασκήσεις που περιλαμβάνουν πολυαρθρικές κινήσεις (compound movements) και ενεργοποιούν τους σταθεροποιητές μύες, βελτιώνοντας την κινητικότητα και τη σταθερότητα.',
          'Cardio & endurance training: Επικεντρώνεται στην ανάπτυξη της καρδιοαναπνευστικής αντοχής μέσω της ζώνης βέλτιστης καρδιακής συχνότητας (target heart rate zone), βελτιώνοντας την ικανότητα του σώματος να χρησιμοποιεί το οξυγόνο αποτελεσματικά.',
          'Αποτελέσματα: Αυτό το είδος προπόνησης (semi personal /group training )συνδυάζει διαφορετικές επιστημονικές αρχές για την ολοκληρωμένη βελτίωση της φυσικής κατάστασης, με εξατομικευμένη καθοδήγηση που προσαρμόζεται στις ανάγκες και τους στόχους κάθε ατόμου ξεχωριστά !'
        ]
      }
    ]
  },
  {
    title: 'Pilates',
    description: 'Ανακαλύψτε την Ισορροπία και την Ευλυγισία με Pilates!',
    items: [
      {
        title: 'Γιατί να επιλέξετε Pilates;',
        points: [
          'Βελτίωση Ευλυγισίας και Δύναμης: Ενισχύστε τους μύες σας και αυξήστε την ευλυγισία σας με προσαρμοσμένες ασκήσεις που επικεντρώνονται στη σταθερότητα του κορμού.',
          'Ενίσχυση Στάσης: Το Pilates βοηθά στη βελτίωση της στάσης του σώματος και της ευθυγράμμισης, μειώνοντας την ένταση και τους πόνους.',
          'Χαλάρωση και Σωματική Επανορθωτική Άσκηση: Ιδανικό για ανακούφιση από το άγχος και την ένταση, προσφέροντας μία ολοκληρωμένη εμπειρία ευεξίας.'
        ]
      }
    ]
  },
  {
    title: 'Cadillac Pilates semi personal (1-2 άτομα)',
    description:
      'Προσφέρει εξειδικευμένη καθοδήγηση από επαγγελματία γυμναστή και εξατομικευμένη προσέγγιση για καλύτερα αποτελέσματα.',
    items: [
      {
        title: 'Γιατί να επιλέξετε Cadillac Pilates;',
        points: [
          'Το Cadillac είναι ένα τρισδιάστατο όργανο Pilates που επιτρέπει μοναδικές ασκήσεις από διάφορες θέσεις (ύπτια, πλάγια, πρηνή, όρθια) και σε όλες τις κατευθύνσεις, προσφέροντας κινήσεις που δεν μπορούν εύκολα να αναπαραχθούν σε άλλα όργανα.',
          'Ιδανικό για άτομα με περιορισμένη κινητικότητα ή έλλειψη ισορροπίας, καθώς διευκολύνει την τοποθέτηση και την υποστήριξη. Ενισχύει την ισορροπία, τον συντονισμό και τη δύναμη.'
        ]
      }
    ]
  },
  {
    title: 'Reformer Pilates semi personal  (1-2 άτομα)',
    description:
      'Παρέχει εξειδικευμένη καθοδήγηση και προσαρμοσμένες ασκήσεις, βοηθώντας στην ενδυνάμωση, την αποκατάσταση και τη βελτίωση της συνολικής απόδοσης με ασφαλή τρόπο.',
    items: [
      {
        title: 'Γιατί να επιλέξετε Reformer Pilates;',
        points: [
          'Πρόκειται για ένα πολυόργανο εκγύμνασης με τεράστια ευελιξία στη χρήση και ιδιαίτερα χαρακτηριστικά τα οποία βοηθούν στην εκτέλεση διαφόρων ασκήσεων προσαρμοσμένων στον/στην ασκούμενο/-η, με αποτέλεσμα την πιο αποδοτική εκγύμναση. Οι κινήσεις/ασκήσεις που μπορούν να γίνουν στο REFORMER είναι εκατοντάδες, ο αριθμός τους "περιορίζεται" μόνο απο τους ανατομικούς περιορισμούς του ανθρώπινου σώματος, κυμαίνονται από βασικές έως εξαιρετικά προχωρημένες και εκτελούνται από κάθε πιθανή θέση και για κάθε πιθανό σκοπό και με βάση τον γυμναστη που θα κρίνει τι θα δουλέψει αποτελεσματικά για την εξέλιξη μας !',
          'Ιδανικό για άτομα με περιορισμένη κινητικότητα ή έλλειψη ισορροπίας, καθώς διευκολύνει την τοποθέτηση και την υποστήριξη. Ενισχύει την ισορροπία, τον συντονισμό και τη δύναμη.',
          'Μεταξύ άλλων, το REFORMER μπορεί να μάς βοηθήσει:Στη βελτίωση των μυοσκελετικών δυσλειτουργιών, συμπεριλαμβανομένης της στάσης του σώματος, και της λειτουργικότητας.Να ανέβουμε ένα επιπλέον σκαλοπάτι στην πρόκληση της άσκησης.Να εξελιχθούμε κινητικά και να βοηθήσουμε και την εξέλιξη μας με τα ελεύθερα βάρη ( βελτιώνουμε κινητικότητα ,αντιλαμβανόμαστε τις θέσεις της λεκάνης ,ισχίων ,ώμων οσφυικης μοίρας ).Να γυμνάσουμε κατάλληλα -κατά τη διάρκεια ενός υποβοηθούμενου σταδίου- άτομα με μυοσκελετικά προβλήματα (τα οποία έχουν ιατρική ένδειξη και έγκριση να ασκηθούν με τη μέθοδο Pilates).'
        ]
      }
    ]
  }
]
