import React from 'react'

const About = () => {
  return (
    <section className='space-y-4 px-[5%] py-16 md:py-24 lg:py-28'>
      <p className='text-lg font-bold'>Η Αποστολή μας.</p>
      <p className='text-sm font-light leading-loose lg:text-lg'>
        Η αποστολή μας είναι να προσφέρουμε έναν χώρο όπου η άσκηση κάθε ατόμου
        βασίζεται στις θεμελιώδεις ανάγκες του σώματός του, υπό την καθοδήγηση
        έμπειρων γυμναστών. Στο γυμναστήριό μας, δημιουργούμε ένα υποστηρικτικό
        και ενθαρρυντικό περιβάλλον, όπου καθένας μπορεί να ανακαλύψει τη δύναμή
        του, να βελτιώσει την υγεία του και να πετύχει τους προσωπικούς του
        στόχους. Εδώ, κάθε προπόνηση είναι εξατομικευμένη και προσαρμοσμένη στις
        μοναδικές ανάγκες του σώματος σας, εξασφαλίζοντας έτσι τα μέγιστα
        αποτελέσματα Ελάτε να γίνετε μέλος της κοινότητάς μας και να ξεκινήσετε
        το ταξίδι σας προς μια καλύτερη εκδοχή του εαυτού σας!
      </p>
    </section>
  )
}

export default About
